# YOLOv9

# parameters
nc: 2  # number of classes
depth_multiple: 1.0  # model depth multiple  * 2 lie
width_multiple: 1.0  # layer channel multiple
#activation: nn.LeakyReLU(0.1)
#activation: nn.ReLU()

# anchors
#anchors: 3

anchors: 1  # number of anchors
loss: OBB

l1: 6
l2: 8
c1: 192
c2: 256

# gelan backbone
backbone:
  [
   # conv down
   [-1, 1, Conv, [32, 3, 2]],  # 0-P1/2

   # conv down
   [-1, 1, Conv, [64, 3, 2]],  # 1-P2/4

   # elan-1 block
#   [-1, 1, ELAN1, [64, 64, 32]],  # 2
   [ -1, 1, CoT3, [ 64 ] ],   #  C3 - 》CoT3

   # avg-conv down
   [-1, 1, AConv, [128]],  # 3-P3/8

   # elan-2 block
#   [-1, 1, RepNCSPELAN4, [128, 128, 64, 3]],  # 4
   [ -1, 2, CoT3, [ 128 ] ],

   # avg-conv down
   [-1, 1, AConv, [192]],  # 5-P4/16

   # elan-2 block
#   [-1, 1, RepNCSPELAN4, [192, 192, 96, 3]],  # 6
   [ -1, 3, CoT3, [ 192 ] ],

   # avg-conv down
   [-1, 1, AConv, [256]],  # 7-P5/32

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [256, 256, 128, 3]],  # 8
#   [ -1, 1, CoT3, [256, False]],
  ]

#  [ [ -1, 1, Convlm, [ 32, 6, 2, 2 ] ],  # 0-P1/2
#    [ -1, 1, Convlm, [ 64, 3, 2 ] ],  # 1-P2/4
#    [ -1, 1, CoT3, [ 64 ] ],          #  C3 - 》CoT3
#    [ -1, 1, Convlm, [ 128, 3, 2 ] ],  # 3-P3/8
#    [ -1, 1, CoT3, [ 128 ] ],
#    [ -1, 1, Convlm, [ 192, 3, 2 ] ],  # 5-P4/16
#    [ -1, 1, CoT3, [ 192 ] ],
#    [ -1, 1, Convlm, [ 256, 3, 2 ] ],  # 7-P5/32
#    [ -1, 1, SPPF, [ 256, 5 ] ],
#    [ -1, 1, CoT3, [256, False]],  # 9  <-------- C3TR() Transformer module
#  ]

# elan head
head:
  [
   # elan-spp block
   [-1, 1, SPPELAN, [256, 128]],  # 9

   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [192, 192, 96, 3]],  # 12

   # up-concat merge
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3

   # elan-2 block
   [-1, 1, RepNCSPELAN4, [128, 128, 64, 3]],  # 15

   # avg-conv-down merge
   [-1, 1, AConv, [96]],
   [[-1, 12], 1, Concat, [1]],  # cat head P4
   # elan-2 block
   [-1, 1, RepNCSPELAN4, [192, 192, 96, 3]],  # 18 (P4/16-medium)


   # avg-conv-down merge
   [-1, 1, AConv, [128]],
   [[-1, 9], 1, Concat, [1]],  # cat head P5
   # elan-2 block
   [-1, 1, RepNCSPELAN4, [256, 256, 128, 3]],  # 21 (P5/32-large)

   # detect
#   [[15, 18, 21], 1, DDetect, [nc]],  # DDetect(P3, P4, P5)

    #v8 head
#   [ [ 15, 18, 21 ], 1, OBB, [ nc, 1 ] ] # OBB(P3, P4, P5)

    #yolox head
   [ 15, 1, Conv, [ 128, 1, 1 ] ],  # 22 lateral0 (P3/8-small)
   [ 18, 1, Conv, [ 192, 1, 1 ] ],  # 23 lateral1 (P4/16-medium)
   [ 21, 1, Conv, [ 256, 1, 1 ] ],  # 24 lateral2 (P5/32-large)

   [ 22, 2, Conv, [ 128, 3, 1 ] ],  # 25 cls0 (P3/8-small)
   [ 22, 2, Conv, [ 128, 3, 1 ] ],  # 26 reg0 (P3/8-small)

   [ 23, 2, Conv, [ 192, 3, 1 ] ],  # 27 cls1 (P4/16-medium)
   [ 23, 2, Conv, [ 192, 3, 1 ] ],  # 28 reg1 (P4/16-medium)

   [ 24, 2, Conv, [ 256, 3, 1 ] ],  # 29 cls2 (P5/32-large)
   [ 24, 2, Conv, [ 256, 3, 1 ] ],  # 30 reg2 (P5/32-large)

    #   [[27, 28, 29, 30, 31, 32], 1, DetectX, [nc, anchors]],  # Detect(P3, P4, P5) DetectYoloX
   [ [ 25,26, 27, 28, 29, 30 ], 1, DetectYoloX, [ nc, anchors ] ],  # Detect(P3, P4, P5) hiyong guanfangtou

  ]
